'__author__ = Суслов Олег Александрович'

# Задача-1: Дано произвольное целое число, вывести самую большую цифру этого числа.
# Например, дается x = 58375.
# Нужно вывести максимальную цифру в данном числе, т.е. 8.
# Подразумевается, что мы не знаем это число заранее.
# Число приходит в виде целого беззнакового.
# Подсказки:
# * постарайтесь решить задачу с применением арифметики и цикла while;
# * при желании и понимании решите задачу с применением цикла for.


"""
numb=45673
Numbs=[]
i=0
while i < len(str(numb)):
    Numbs.append(int((str(numb))[i]))
    i=i+1
Maxnumb = max(Numbs)
print("Максимальное число -",Maxnumb)
"""

# Задача-2: Исходные значения двух переменных запросить у пользователя.
# Поменять значения переменных местами. Вывести новые значения на экран.
# Решите задачу, используя только две переменные.
# Подсказки:
# * постарайтесь сделать решение через действия над числами;
# * при желании и понимании воспользуйтесь синтаксисом кортежей Python.

a = input ("Введите первое число = ")
b = input ("Введите второе число = ")
Massiv=[]
Massiv.append(a)
Massiv.append(b)
print("Первое значение = ",a)
print("Второе значение = ",b)
print("Меняем значения местами!!!")
a=Massiv[1]
b= Massiv[0]
print("Теперь первое значение = ",a)
print("Теперь второе значение = ",b)
