# Автор ____ Суслов Олег Алекчандрович_______:



# Задание-1:
# Напишите функцию, возвращающую ряд Фибоначчи с n-элемента до m-элемента.
# Первыми элементами ряда считать цифры 1 1
print ()
print ()
print ("Решение первого задания уровня Нормал")
print ()
print ()
n=0
m=1
#VVod nachalnogo i konechnogo nomerov ryada fobonacchi
n=input ("Введите начальный порядковый номер ряда Фибоначчи:  ")
print ()
m=input ("Введите конечный порядковый номер ряда Фибоначчи:   ")
print ()
#Proverka korrektnosti vvoda
priznak = False
while priznak==False:
    if n.isnumeric()==True and m.isnumeric() == True:
        if int(m)-int(n)>0:
           priznak=True
        else:
            priznak = False
            print ("Ошибка ввода порядковых номеров ряда:")
            print (" - Начальный номер ряда должен быть меньше конечного.")
            print ()
            print ("Повторите ввод")
            print ()
            print ()
            n=input ("Введите начальный порядковый номер ряда Фибоначчи:  ")
            print ()
            m=input ("Введите конечный порядковый номер ряда Фибоначчи:   ")
            print ()
    else:
        priznak = False
        print ("Ошибка ввода порядковых номеров ряда:")
        print (" - Необходимо вводить челые числа.")
        print ()
        print ("Повторите ввод")
        print ()
        print ()
        n=input ("Введите начальный порядковый номер ряда Фибоначчи:  ")
        print ()
        m=input ("Введите конечный порядковый номер ряда Фибоначчи:   ")
        print ()
        
'''    

def fibonacci(n, m):
    fIb= []
    fib[0] =1
    fib[1] =1
        

    for el in m:
        fib 
    pass

# Задача-2:
# Напишите функцию, сортирующую принимаемый список по возрастанию.
# Для сортировки используйте любой алгоритм (например пузырьковый).
# Для решения данной задачи нельзя использовать встроенную функцию и метод sort()


def sort_to_max(origin_list):
    pass

sort_to_max([2, 10, -12, 2.5, 20, -11, 4, 4, 0])

# Задача-3:
# Напишите собственную реализацию стандартной функции filter.
# Разумеется, внутри нельзя использовать саму функцию filter.


# Задача-4:
# Даны четыре точки А1(х1, у1), А2(x2 ,у2), А3(x3 , у3), А4(х4, у4).
# Определить, будут ли они вершинами параллелограмма.
'''

